aws/amazon-freertos/vendors/renesas/boards/rx65n-rsk/ports/pkcs11/core_pkcs11_pal.c
typedef struct _pkcs_storage_control_block_sub
{
    uint8_t local_storage[ ( ( FLASH_DF_BLOCK_SIZE * FLASH_NUM_BLOCKS_DF ) / 4 ) - ( sizeof( PKCS_DATA ) * PKCS_OBJECT_HANDLES_NUM ) - PKCS_SHA256_LENGTH ]; /* RX65N case: 8KB */
    PKCS_DATA pkcs_data[ PKCS_OBJECT_HANDLES_NUM ];
} PKCS_STORAGE_CONTROL_BLOCK_SUB;

typedef struct _PKCS_CONTROL_BLOCK
{
    PKCS_STORAGE_CONTROL_BLOCK_SUB data;
    uint8_t hash_sha256[ PKCS_SHA256_LENGTH ];
} PKCS_CONTROL_BLOCK;

enum eObjectHandles
{
    eInvalidHandle = 0, /* According to PKCS #11 spec, 0 is never a valid object handle. */
    eAwsDevicePrivateKey = 1,
    eAwsDevicePublicKey,
    eAwsDeviceCertificate,
    eAwsCodeSigningKey,
    /*eAwsRootCertificate */
};

uint8_t object_handle_dictionary[ PKCS_OBJECT_HANDLES_NUM ][ PKCS_HANDLES_LABEL_MAX_LENGTH ] =
{
    "",
    pkcs11configLABEL_DEVICE_PRIVATE_KEY_FOR_TLS,
    pkcs11configLABEL_DEVICE_PUBLIC_KEY_FOR_TLS,
    pkcs11configLABEL_DEVICE_CERTIFICATE_FOR_TLS,
    pkcs11configLABEL_CODE_VERIFICATION_KEY,
    /*pkcs11configLABEL_ROOT_CERTIFICATE, */
};

static PKCS_CONTROL_BLOCK pkcs_control_block_data_image; /* RX65N case: 8KB, RX64M case: 16KB, RX63N case: 8KB */

R_BSP_ATTRIB_SECTION_CHANGE( C, _PKCS11_STORAGE, 1 )
static const PKCS_CONTROL_BLOCK pkcs_control_block_data = { PKCS_CONTROL_BLOCK_INITIAL_DATA };
R_BSP_ATTRIB_SECTION_CHANGE_END R_BSP_ATTRIB_SECTION_CHANGE( C,
                                                             _PKCS11_STORAGE_MIRROR,
                                                             1 )
static const PKCS_CONTROL_BLOCK pkcs_control_block_data_mirror =
{
    PKCS_CONTROL_BLOCK_INITIAL_DATA
}
R_BSP_ATTRIB_SECTION_CHANGE_END

static void update_dataflash_data_from_image( void );
static void update_dataflash_data_mirror_from_image( void );
static void check_dataflash_area( uint32_t retry_counter );

void data_flash_update_status_initialize( void );
static void update_data_flash_callback_function( void * event );

typedef struct _update_data_flash_control_block
{
    uint32_t status;
} UPDATA_DATA_FLASH_CONTROL_BLOCK;

/******************************************************************************
*  Private global variables
******************************************************************************/
static UPDATA_DATA_FLASH_CONTROL_BLOCK update_data_flash_control_block;

CK_RV PKCS11_PAL_Initialize( CK_VOID_PTR pvInitArgs )
{
    CK_RV xResult = CKR_OK;

    CRYPTO_Init();
    R_FLASH_Open();

    #if defined( BSP_MCU_RX63N ) || ( BSP_MCU_RX631 ) || ( BSP_MCU_RX630 )
        flash_access_window_config_t flash_access_window_config;
        flash_access_window_config.read_en_mask = 0xffff;
        flash_access_window_config.write_en_mask = 0xffff;
        R_FLASH_Control( FLASH_CMD_ACCESSWINDOW_SET, &flash_access_window_config );
    #endif

    /* check the hash */
    check_dataflash_area( 0 );

    /* copy data from storage to ram */
    memcpy( &pkcs_control_block_data_image, ( void * ) &pkcs_control_block_data, sizeof( pkcs_control_block_data_image ) );

    R_FLASH_Close();

    return xResult;
}

/**
 * @brief Writes a file to local storage.
 *
 * Port-specific file write for crytographic information.
 *
 * @param[in] pxLabel       Label of the object to be saved.
 * @param[in] pucData       Data buffer to be written to file
 * @param[in] ulDataSize    Size (in bytes) of data to be saved.
 *
 * @return The file handle of the object that was stored.
 */
CK_OBJECT_HANDLE PKCS11_PAL_SaveObject( CK_ATTRIBUTE_PTR pxLabel,
                                        uint8_t * pucData,
                                        uint32_t ulDataSize )
{
    CK_OBJECT_HANDLE xHandle = eInvalidHandle;
    int i;
    uint8_t hash_sha256[ PKCS_SHA256_LENGTH ];
    mbedtls_sha256_context ctx;

    mbedtls_sha256_init( &ctx );
    R_FLASH_Open();

    #if defined( BSP_MCU_RX63N ) || ( BSP_MCU_RX631 ) || ( BSP_MCU_RX630 )
        flash_access_window_config_t flash_access_window_config;
        flash_access_window_config.read_en_mask = 0xffff;
        flash_access_window_config.write_en_mask = 0xffff;
        R_FLASH_Control( FLASH_CMD_ACCESSWINDOW_SET, &flash_access_window_config );
    #endif

    /* check the hash */
    check_dataflash_area( 0 );

    /* copy data from storage to ram */
    memcpy( &pkcs_control_block_data_image, ( void * ) &pkcs_control_block_data, sizeof( pkcs_control_block_data_image ) );

    /* search specified label value from object_handle_dictionary */
    for( i = 1; i < PKCS_OBJECT_HANDLES_NUM; i++ )
    {
        if( !strcmp( ( char * ) &object_handle_dictionary[ i ], pxLabel->pValue ) )
        {
            xHandle = i;
        }
    }

    if( xHandle != eInvalidHandle )
    {
        /* pre-calculate -> total stored data size : pre-calculate phase */
        uint32_t total_stored_data_size = 0;

        for( int i = 1; i < PKCS_OBJECT_HANDLES_NUM; i++ )
        {
            if( pkcs_control_block_data_image.data.pkcs_data[ i ].status == PKCS_DATA_STATUS_REGISTERED )
            {
                total_stored_data_size += pkcs_control_block_data_image.data.pkcs_data[ i ].ulDataSize;
            }
        }

        /* remove current xHandle from pkcs_data */
        if( pkcs_control_block_data_image.data.pkcs_data[ xHandle ].status == PKCS_DATA_STATUS_REGISTERED )
        {
            uint32_t move_target_xHandle = 0, move_target_index = 0;

            uint32_t delete_target_index = pkcs_control_block_data_image.data.pkcs_data[ xHandle ].local_storage_index;
            uint32_t delete_target_data_size = pkcs_control_block_data_image.data.pkcs_data[ xHandle ].ulDataSize;

            /* Search move target index and handle  */
            for( int i = 1; i < PKCS_OBJECT_HANDLES_NUM; i++ )
            {
                if( ( pkcs_control_block_data_image.data.pkcs_data[ i ].status == PKCS_DATA_STATUS_REGISTERED ) &&
                    ( pkcs_control_block_data_image.data.pkcs_data[ i ].local_storage_index == ( delete_target_index + delete_target_data_size ) ) )
                {
                    move_target_xHandle = i;
                    move_target_index = pkcs_control_block_data_image.data.pkcs_data[ i ].local_storage_index;
                    break;
                }
            }

