aws/amazon-freertos/vendors/renesas/boards/rx65n-rsk/ports/pkcs11/core_pkcs11_pal.c
            if( move_target_xHandle != 0 )
            {
                /* Move target index to delete target index */
                memmove(
                    ( void * ) &pkcs_control_block_data_image.data.local_storage[ delete_target_index ],
                    ( void * ) &pkcs_control_block_data_image.data.local_storage[ move_target_index ],
                    ( size_t ) total_stored_data_size - move_target_index );

                /* Fix index of all moved data  */
                for( int i = 1; i < PKCS_OBJECT_HANDLES_NUM; i++ )
                {
                    if( pkcs_control_block_data_image.data.pkcs_data[ i ].local_storage_index > delete_target_index )
                    {
                        pkcs_control_block_data_image.data.pkcs_data[ i ].local_storage_index -= delete_target_data_size;
                    }
                }
            }

            /* Recalculate the end of data storage  */
            total_stored_data_size -= delete_target_data_size;

            pkcs_control_block_data_image.data.pkcs_data[ xHandle ].local_storage_index = 0;
            pkcs_control_block_data_image.data.pkcs_data[ xHandle ].ulDataSize = 0;
        }

        pkcs_control_block_data_image.data.pkcs_data[ xHandle ].Label.type = pxLabel->type;
        pkcs_control_block_data_image.data.pkcs_data[ xHandle ].Label.ulValueLen = pxLabel->ulValueLen;
        pkcs_control_block_data_image.data.pkcs_data[ xHandle ].local_storage_index = total_stored_data_size;
        pkcs_control_block_data_image.data.pkcs_data[ xHandle ].ulDataSize = ulDataSize;
        pkcs_control_block_data_image.data.pkcs_data[ xHandle ].status = PKCS_DATA_STATUS_REGISTERED;
        pkcs_control_block_data_image.data.pkcs_data[ xHandle ].xHandle = xHandle;
        memcpy( &pkcs_control_block_data_image.data.local_storage[ total_stored_data_size ], pucData, ulDataSize );

        /* update the hash */
        mbedtls_sha256_starts_ret( &ctx, 0 ); /* 0 means SHA256 context */
        mbedtls_sha256_update_ret( &ctx, ( unsigned char * ) &pkcs_control_block_data_image.data, sizeof( pkcs_control_block_data.data ) );
        mbedtls_sha256_finish_ret( &ctx, hash_sha256 );
        memcpy( pkcs_control_block_data_image.hash_sha256, hash_sha256, sizeof( hash_sha256 ) );

        /* update data from ram to storage */
        data_flash_update_status_initialize();

        while( update_data_flash_control_block.status < DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
        {
            update_dataflash_data_from_image();
            vTaskDelay( 1 );
        }

        if( update_data_flash_control_block.status == DATA_FLASH_UPDATE_STATE_ERROR )
        {
            PKCS11_PAL_DEBUG_PRINT( ( "ERROR: Update data flash data from image\r\n" ) );

            while( 1 )
            {
            }
        }

        data_flash_update_status_initialize();

        while( update_data_flash_control_block.status < DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED )
        {
            update_dataflash_data_mirror_from_image();
            vTaskDelay( 1 );
        }

        if( update_data_flash_control_block.status == DATA_FLASH_UPDATE_STATE_ERROR )
        {
            PKCS11_PAL_DEBUG_PRINT( ( "ERROR: Update data flash data mirror from image\r\n" ) );

            while( 1 )
            {
            }
        }
    }

    R_FLASH_Close();

    return xHandle;
}

/**
 * @brief Translates a PKCS #11 label into an object handle.
 *
 * Port-specific object handle retrieval.
 *
 *
 * @param[in] pLabel         Pointer to the label of the object
 *                           who's handle should be found.
 * @param[in] usLength       The length of the label, in bytes.
 *
 * @return The object handle if operation was successful.
 * Returns eInvalidHandle if unsuccessful.
 */
CK_OBJECT_HANDLE PKCS11_PAL_FindObject( uint8_t * pLabel,
                                        uint8_t usLength )
{
    CK_OBJECT_HANDLE xHandle = eInvalidHandle;
    int i;

    for( i = 1; i < PKCS_OBJECT_HANDLES_NUM; i++ )
    {
        if( !strcmp( ( char * ) &object_handle_dictionary[ i ], ( char * ) pLabel ) )
        {
            if( pkcs_control_block_data_image.data.pkcs_data[ i ].status == PKCS_DATA_STATUS_REGISTERED )
            {
                xHandle = i;
            }
        }
    }

    return xHandle;
}

/**
 * @brief Gets the value of an object in storage, by handle.
 *
 * Port-specific file access for cryptographic information.
 *
 * This call dynamically allocates the buffer which object value
 * data is copied into.  PKCS11_PAL_GetObjectValueCleanup()
 * should be called after each use to free the dynamically allocated
 * buffer.
 *
 * @sa PKCS11_PAL_GetObjectValueCleanup
 *
 * @param[in] pcFileName    The name of the file to be read.
 * @param[out] ppucData     Pointer to buffer for file data.
 * @param[out] pulDataSize  Size (in bytes) of data located in file.
 * @param[out] pIsPrivate   Boolean indicating if value is private (CK_TRUE)
 *                          or exportable (CK_FALSE)
 *
 * @return CKR_OK if operation was successful.  CKR_KEY_HANDLE_INVALID if
 * no such object handle was found, CKR_DEVICE_MEMORY if memory for
 * buffer could not be allocated, CKR_FUNCTION_FAILED for device driver
 * error.
 */
CK_RV PKCS11_PAL_GetObjectValue( CK_OBJECT_HANDLE xHandle,
                                 uint8_t ** ppucData,
                                 uint32_t * pulDataSize,
                                 CK_BBOOL * pIsPrivate )
{
    CK_RV xReturn = CKR_FUNCTION_FAILED;
    CK_OBJECT_HANDLE xHandleStorage = xHandle;


    if( xHandleStorage == eAwsDevicePublicKey )
    {
        xHandleStorage = eAwsDevicePrivateKey;
    }

    if( xHandle != eInvalidHandle )
    {
        *ppucData = &pkcs_control_block_data_image.data.local_storage[ pkcs_control_block_data_image.data.pkcs_data[ xHandleStorage ].local_storage_index ];
        *pulDataSize = pkcs_control_block_data_image.data.pkcs_data[ xHandleStorage ].ulDataSize;

        if( xHandle == eAwsDevicePrivateKey )
        {
            *pIsPrivate = CK_TRUE;
        }
        else
        {
            *pIsPrivate = CK_FALSE;
        }

        xReturn = CKR_OK;
    }

    return xReturn;
}


/**
 * @brief Cleanup after PKCS11_GetObjectValue().
 *
 * @param[in] pucData       The buffer to free.
 *                          (*ppucData from PKCS11_PAL_GetObjectValue())
 * @param[in] ulDataSize    The length of the buffer to free.
 *                          (*pulDataSize from PKCS11_PAL_GetObjectValue())
 */
void PKCS11_PAL_GetObjectValueCleanup( uint8_t * pucData,
                                       uint32_t ulDataSize )
{
    /* todo: nothing to do in now. Now, pkcs_data exists as static. I will fix this function when I will port this to heap memory. (Renesas/Ishiguro) */
}

static void update_dataflash_data_from_image( void )
{
    flash_interrupt_config_t cb_func_info;
    static uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    switch( update_data_flash_control_block.status )
    {
        case DATA_FLASH_UPDATE_STATE_INITIALIZE: /* initialize */
            cb_func_info.pcallback = update_data_flash_callback_function;
            cb_func_info.int_priority = 15;
            R_FLASH_Control( FLASH_CMD_SET_BGO_CALLBACK, ( void * ) &cb_func_info );
            required_dataflash_block_num = sizeof( PKCS_CONTROL_BLOCK ) / FLASH_DF_BLOCK_SIZE;

            if( sizeof( PKCS_CONTROL_BLOCK ) % FLASH_DF_BLOCK_SIZE )
            {
                required_dataflash_block_num++;
            }

