aws/amazon-freertos/vendors/renesas/boards/rx65n-rsk/ports/pkcs11/core_pkcs11_pal.c
            update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_ERASE;
            break;

        case DATA_FLASH_UPDATE_STATE_ERASE: /* erase bank0 (0xFFE00000-0xFFEF0000) */
            PKCS11_PAL_DEBUG_PRINT( ( "erase dataflash(main)...\r\n" ) );
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Erase( ( flash_block_address_t ) &pkcs_control_block_data, required_dataflash_block_num );
            R_BSP_InterruptsEnable();

            if( FLASH_SUCCESS == flash_error_code )
            {
                PKCS11_PAL_DEBUG_PRINT( ( "OK\r\n" ) );
            }
            else
            {
                PKCS11_PAL_DEBUG_PRINT( ( "NG\r\n" ) );
                PKCS11_PAL_DEBUG_PRINT( ( "R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code ) );
            }

            update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE;
            break;

        case DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;

        case DATA_FLASH_UPDATE_STATE_WRITE:
            PKCS11_PAL_DEBUG_PRINT( ( "write dataflash(main)...\r\n" ) );
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Write( ( flash_block_address_t ) &pkcs_control_block_data_image, ( flash_block_address_t ) &pkcs_control_block_data, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num );
            R_BSP_InterruptsEnable();

            if( FLASH_SUCCESS == flash_error_code )
            {
                PKCS11_PAL_DEBUG_PRINT( ( "OK\r\n" ) );
            }
            else
            {
                PKCS11_PAL_DEBUG_PRINT( ( "NG\r\n" ) );
                PKCS11_PAL_DEBUG_PRINT( ( "R_FLASH_Write() returns error code = %d.\r\n", flash_error_code ) );
                return;
            }

            update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE;
            break;

        case DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;

        case DATA_FLASH_UPDATE_STATE_FINALIZE: /* finalize */
            update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED;
            break;

        default:
            break;
    }

    return;
}

static void update_dataflash_data_mirror_from_image( void )
{
    flash_interrupt_config_t cb_func_info;
    static uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    switch( update_data_flash_control_block.status )
    {
        case DATA_FLASH_UPDATE_STATE_INITIALIZE: /* initialize */
            cb_func_info.pcallback = update_data_flash_callback_function;
            cb_func_info.int_priority = 15;
            R_FLASH_Control( FLASH_CMD_SET_BGO_CALLBACK, ( void * ) &cb_func_info );
            required_dataflash_block_num = sizeof( PKCS_CONTROL_BLOCK ) / FLASH_DF_BLOCK_SIZE;

            if( sizeof( PKCS_CONTROL_BLOCK ) % FLASH_DF_BLOCK_SIZE )
            {
                required_dataflash_block_num++;
            }

            update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_ERASE;
            break;

        case DATA_FLASH_UPDATE_STATE_ERASE: /* erase bank0 (0xFFE00000-0xFFEF0000) */
            PKCS11_PAL_DEBUG_PRINT( ( "erase dataflash(mirror)...\r\n" ) );
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Erase( ( flash_block_address_t ) &pkcs_control_block_data_mirror, required_dataflash_block_num );
            R_BSP_InterruptsEnable();

            if( FLASH_SUCCESS == flash_error_code )
            {
                PKCS11_PAL_DEBUG_PRINT( ( "OK\r\n" ) );
            }
            else
            {
                PKCS11_PAL_DEBUG_PRINT( ( "NG\r\n" ) );
                PKCS11_PAL_DEBUG_PRINT( ( "R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code ) );
                return;
            }

            update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE;
            break;

        case DATA_FLASH_UPDATE_STATE_ERASE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;

        case DATA_FLASH_UPDATE_STATE_WRITE:
            PKCS11_PAL_DEBUG_PRINT( ( "write dataflash(mirror)...\r\n" ) );
            R_BSP_InterruptsDisable();
            flash_error_code = R_FLASH_Write( ( flash_block_address_t ) &pkcs_control_block_data_image, ( flash_block_address_t ) &pkcs_control_block_data_mirror, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num );
            R_BSP_InterruptsEnable();

            if( FLASH_SUCCESS == flash_error_code )
            {
                PKCS11_PAL_DEBUG_PRINT( ( "OK\r\n" ) );
            }
            else
            {
                PKCS11_PAL_DEBUG_PRINT( ( "NG\r\n" ) );
                PKCS11_PAL_DEBUG_PRINT( ( "R_FLASH_Write() returns error code = %d.\r\n", flash_error_code ) );
                return;
            }

            update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE;
            break;

        case DATA_FLASH_UPDATE_STATE_WRITE_WAIT_COMPLETE:
            /* this state will be changed by callback routine */
            break;

        case DATA_FLASH_UPDATE_STATE_FINALIZE: /* finalize */

            if( !memcmp( &pkcs_control_block_data, &pkcs_control_block_data_mirror, sizeof( PKCS_CONTROL_BLOCK ) ) )
            {
                PKCS11_PAL_DEBUG_PRINT( ( "data flash setting OK.\r\n" ) );
            }
            else
            {
                PKCS11_PAL_DEBUG_PRINT( ( "data flash setting NG.\r\n" ) );
                return;
            }

            update_data_flash_control_block.status = DATA_FLASH_UPDATE_STATE_FINALIZE_COMPLETED;
            break;

        default:
            break;
    }

    return;
}

static void check_dataflash_area( uint32_t retry_counter )
{
    uint8_t hash_sha256[ PKCS_SHA256_LENGTH ];
    mbedtls_sha256_context ctx;

    mbedtls_sha256_init( &ctx );

    if( retry_counter )
    {
        PKCS11_PAL_DEBUG_PRINT( ( "recover retry count = %d.\r\n", retry_counter ) );

